# config.py

# Токен вашего бота, который вы получили от @BotFather.
# Обязательно вставьте сюда свой реальный токен.
BOT_TOKEN = "8033614301:AAEmSCB0g96RhQh6D_eBEpwZqDtcLsUIvJQ"

# Ваш личный ID в Telegram или ID чата менеджера.
# Чтобы его узнать, напишите боту @userinfobot, он пришлет ваш ID.
ADMIN_CHAT_ID = "764788161"

# Строка для подключения к базе данных PostgreSQL, которую мы настроили через Homebrew.
# Замените `<имя_пользователя>` на ваше имя пользователя в macOS.
# Чтобы узнать его, введите команду `whoami` в Терминале.
DATABASE_URL = "postgresql://isk@localhost/tea_shop_db"

# Ссылка, по которой будет доступен ваш Mini App (фронтенд).
# Когда вы развернете фронтенд, вы замените эту ссылку на настоящую.
# Пока можно оставить так, но для работы кнопки она должна быть валидной https-ссылкой.
WEBAPP_URL = "https://legendary-quokka-028502.netlify.app/"
